stevanStevic/esp32-project-template/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
# Defaults for ESP32S3 WROOVER
CONFIG_IDF_TARGET="esp32s3"

# Custom Partition Table for 16MB Flash with OTA Support
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="custom_partitions.csv"
# When bootlader is signed we need to move starting position of the partition table.
# In order to align it we just move fro default dev build too.
CONFIG_PARTITION_TABLE_OFFSET=0x10000

# Flash configuration
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM configuration
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# coredump configuration
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_MAX_TASK_STACK_SIZE=2048

# Main task stack size (default 3584 is too small for app_main)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
